# На основі попередньої функції створити наступний кусок кода:
# а) створити список із парами ім'я/пароль різноманітних видів 
# (орієнтуйтесь по правилам своєї функції) - як валідні, так і ні;
# б) створити цикл, який пройдеться по цьому циклу і, користуючись 
# валідатором, перевірить ці дані і надрукує для кожної пари значень 
# відповідне повідомлення, наприклад:
# Name: vasya
# Password: wasd
# Status: password must have at least one digit
------
# Name: vasya
# Password: vasyapupkin2000
# Status: OK

      