# Написати функцію, яка приймає два параметри: ім'я файлу та кількість символів. 
# На екран повинен вивестись список із трьома блоками - символи з початку, із середини та з кінця файлу. 
# Кількість символів в блоках - та, яка введена в другому параметрі. 
# Придумайте самі, як обробляти помилку, наприклад, коли кількість символів більша, ніж є в файлі (наприклад, файл із двох символів і треба вивести по одному символу, то що виводити на місці середнього блоку символів?) 
# В репозиторій додайте і ті файли, по яким робили тести. 
# Як визначати середину файлу (з якої брать необхідні символи) - кількість символів поділити навпіл, а отримане "вікно" символів відцентрувати щодо середини файла і взяти необхідну кількість. В разі необхідності заокруглення одного чи обох параметрів - дивіться на свій розсуд.
# Наприклад:
#   █ █ █ ░ ░ ░ ░ ░ █ █ █ ░ ░ ░ ░ ░ █ █ █    - правильно
#                     ⏫ центр 
#   █ █ █ ░ ░ ░ ░ ░ ░ █ █ █ ░ ░ ░ ░ █ █ █    - неправильно 
#                     ⏫ центр

def func(user_test, simbol):
	if simbol <= 0:
		print('Кількість символів повинна бути більше ніж 0')
	else:
		with open(user_test, 'r') as f:
			text = f.read()

		if len(text) >= simbol:
			centr_text = ((len(text) + 1) // 2)
			centr = text[int(centr_text - simbol / 2):int(centr_text + simbol / 2)]
			print(f'Початок: {text[:simbol]}')
			print(f'Кінець: {text[-simbol:]}')
			print(f'Середина: {centr}')
		else:
			print(f'Кількість символів повинна бути не більше ніж: {len(text)}')
	
simbol = int(input('Введіть число: '))
func('test_1.txt', simbol)