# Маємо рядок --> "f98neroi4nr0c3n30ir5jnpoj35po6j345" -> 
# Створіть ф-цiю, яка буде отримувати рядки на зразок цього, яка оброблює 
# наступні випадки:
# -  якщо довжина рядка в діапазонi 30-50 -> прiнтує довжину, кiлькiсть 
# букв та цифр
# -  якщо довжина менше 30 -> прiнтує суму всiх чисел та окремо рядок 
# без цифр (лише з буквами)
# -  якщо довжина бульше 50 - > ваша фантазiя

str = "jgedfggf15hrth5fgfgbg32b3t3h6"
if 30 < len(str) < 50:
    print(len(str))
elif len(str) < 30:
    print(len(str))
elif len(str) > 50:
    print("Бімба")